Финансы/src/Catalogs/Транзакции/Транзакции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Транзакции</name>
  <attributes>
    <name>КлючТранзакции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранзакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Финансы/src/Catalogs/Транзакции/ManagerModule.bsl
Функция НайтиПоКлючуТранзакции(СтрКлючТранзакции) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Транзакции.Ссылка
		|ИЗ
		|	Справочник.Транзакции КАК Транзакции
		|ГДЕ
		|	Транзакции.КлючТранзакции ПОДОБНО &СтрКлючТранзакции";

	Запрос.УстановитьПараметр("СтрКлючТранзакции", СтрКлючТранзакции);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Справочники.Транзакции.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМаксимальныйНомерТранзакцииПоКлючу(СтрКлючТранзакции) Экспорт
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Транзакции.НомерТранзакции КАК НомерТранзакции
		|ИЗ
		|	Справочник.Транзакции КАК Транзакции
		|ГДЕ
		|	Транзакции.КлючТранзакции ПОДОБНО &СтрКлючТранзакции
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерТранзакции УБЫВ";

	Запрос.УстановитьПараметр("СтрКлючТранзакции", СтрКлючТранзакции);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.НомерТранзакции;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции
